symbolic_math/lecture_trial_memo.org
* printout
だめみたい．．．数値計算の学生はどうやってたのだろう．．．
1. といあわせる
2. ファイルの上げ方を教えてもらう
IEではだめ．Chromeでも少しダメ．FireFoxだと問題ない．

* nbviewer
githubだと，ipynbをいちいちformatするようで，時間がかかる．
そこで，nbviewerを使おうとしたが．．．
うううん．どうやるのが正しいのかわからないが．．．

githubにあげたのは，nbviewerでそのまま見れる．
アドレスは，
https://nbviewer.jupyter.org/github/daddygongon/jupyter_num_calc/blob/master/symbolic_math/equation_manipulation.ipynb
みたいに，blob/masterが間に入っているだけ．．．
これをlinkとして貼り付けるだけ．．．ほんまかな．．．

* githubでの表示
- githubでipynbを直接開くと時々latex部の表示がおかしい．
- nbviewerからだと正常に見える．
* filesの置き場所
nbviewerだけでは，悩ましい．
ipynbをそのまま使ったほうが良い場合もあるし．．．
何と言ってもgithubのdirectory構造とhikiのが違う．
これをタグ付けみたいにして，一つにできるといいが．．．
ipynbとdirecotyとの自動対応か．
それにhikiが絡むからややこしい．．．

* gistからの試み(止めた)
gist --login
setproxy

Obtaining OAuth2 access_token from github.
GitHub username: daddygongon
GitHub password: 
Success! https://github.com/settings/tokens

gist README.ipynb
https://gist.github.com/3a361f9b50dea769c468be80d248f9bf

gistのを使うとわけのわからん記号なんで．．．パス．
