math_with_python_html/symbolic_math/lecture_trial_memo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>lecture_trial_memo</title>
<!-- 2018-05-11 金 11:00 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="bob" />
</head>
<body>
<div id="content">
<h1 class="title">lecture_trial_memo</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">printout</a></li>
<li><a href="#sec-2">nbviewer</a></li>
<li><a href="#sec-3">githubでの表示</a></li>
<li><a href="#sec-4">filesの置き場所</a></li>
<li><a href="#sec-5">gistからの試み(止めた)</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">printout</h2>
<div class="outline-text-2" id="text-1">
<p>
だめみたい．．．数値計算の学生はどうやってたのだろう．．．
</p>
<ol class="org-ol">
<li>といあわせる
</li>
<li>ファイルの上げ方を教えてもらう
</li>
</ol>
<p>
IEではだめ．Chromeでも少しダメ．FireFoxだと問題ない．
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">nbviewer</h2>
<div class="outline-text-2" id="text-2">
<p>
githubだと，ipynbをいちいちformatするようで，時間がかかる．
そこで，nbviewerを使おうとしたが．．．
うううん．どうやるのが正しいのかわからないが．．．
</p>

<p>
githubにあげたのは，nbviewerでそのまま見れる．
アドレスは，
<a href="https://nbviewer.jupyter.org/github/daddygongon/jupyter_num_calc/blob/master/symbolic_math/equation_manipulation.ipynb">https://nbviewer.jupyter.org/github/daddygongon/jupyter_num_calc/blob/master/symbolic_math/equation_manipulation.ipynb</a>
みたいに，blob/masterが間に入っているだけ．．．
これをlinkとして貼り付けるだけ．．．ほんまかな．．．
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">githubでの表示</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>githubでipynbを直接開くと時々latex部の表示がおかしい．
</li>
<li>nbviewerからだと正常に見える．
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">filesの置き場所</h2>
<div class="outline-text-2" id="text-4">
<p>
nbviewerだけでは，悩ましい．
ipynbをそのまま使ったほうが良い場合もあるし．．．
何と言ってもgithubのdirectory構造とhikiのが違う．
これをタグ付けみたいにして，一つにできるといいが．．．
ipynbとdirecotyとの自動対応か．
それにhikiが絡むからややこしい．．．
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">gistからの試み(止めた)</h2>
<div class="outline-text-2" id="text-5">
<p>
gist &#x2013;login
setproxy
</p>

<p>
Obtaining OAuth2 access<sub>token</sub> from github.
GitHub username: daddygongon
GitHub password: 
Success! <a href="https://github.com/settings/tokens">https://github.com/settings/tokens</a>
</p>

<p>
gist README.ipynb
<a href="https://gist.github.com/3a361f9b50dea769c468be80d248f9bf">https://gist.github.com/3a361f9b50dea769c468be80d248f9bf</a>
</p>

<p>
gistのを使うとわけのわからん記号なんで．．．パス．
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: bob</p>
<p class="date">Created: 2018-05-11 金 11:00</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
